event-platform/loadtest/allure-report/data/attachments/1f48a087150794a7.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/ingestion_10k_loadtest.ts
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * ten_k_load_test: 10000 iterations shared among 50 VUs (maxDuration: 5m0s, gracefulStop: 30s)


running (0m00.9s), 50/50 VUs, 44 complete and 0 interrupted iterations
ten_k_load_test   [   0% ] 50 VUs  0m00.9s/5m0s  00044/10000 shared iters

running (0m02.0s), 50/50 VUs, 102 complete and 0 interrupted iterations
ten_k_load_test   [   1% ] 50 VUs  0m02.0s/5m0s  00102/10000 shared iters

running (0m02.9s), 50/50 VUs, 141 complete and 0 interrupted iterations
ten_k_load_test   [   1% ] 50 VUs  0m02.9s/5m0s  00141/10000 shared iters

running (0m03.9s), 50/50 VUs, 210 complete and 0 interrupted iterations
ten_k_load_test   [   2% ] 50 VUs  0m03.9s/5m0s  00210/10000 shared iters

running (0m04.9s), 50/50 VUs, 266 complete and 0 interrupted iterations
ten_k_load_test   [   3% ] 50 VUs  0m04.9s/5m0s  00266/10000 shared iters

running (0m05.9s), 50/50 VUs, 322 complete and 0 interrupted iterations
ten_k_load_test   [   3% ] 50 VUs  0m05.9s/5m0s  00322/10000 shared iters

running (0m06.9s), 50/50 VUs, 405 complete and 0 interrupted iterations
ten_k_load_test   [   4% ] 50 VUs  0m06.9s/5m0s  00405/10000 shared iters

running (0m07.9s), 50/50 VUs, 460 complete and 0 interrupted iterations
ten_k_load_test   [   5% ] 50 VUs  0m07.9s/5m0s  00460/10000 shared iters

running (0m08.9s), 50/50 VUs, 512 complete and 0 interrupted iterations
ten_k_load_test   [   5% ] 50 VUs  0m08.9s/5m0s  00512/10000 shared iters

running (0m09.9s), 50/50 VUs, 586 complete and 0 interrupted iterations
ten_k_load_test   [   6% ] 50 VUs  0m09.9s/5m0s  00586/10000 shared iters

running (0m11.0s), 50/50 VUs, 646 complete and 0 interrupted iterations
ten_k_load_test   [   6% ] 50 VUs  0m11.0s/5m0s  00646/10000 shared iters

running (0m11.9s), 50/50 VUs, 690 complete and 0 interrupted iterations
ten_k_load_test   [   7% ] 50 VUs  0m11.9s/5m0s  00690/10000 shared iters

running (0m12.9s), 50/50 VUs, 742 complete and 0 interrupted iterations
ten_k_load_test   [   7% ] 50 VUs  0m12.9s/5m0s  00742/10000 shared iters

running (0m13.9s), 50/50 VUs, 793 complete and 0 interrupted iterations
ten_k_load_test   [   8% ] 50 VUs  0m13.9s/5m0s  00793/10000 shared iters

running (0m15.1s), 50/50 VUs, 843 complete and 0 interrupted iterations
ten_k_load_test   [   8% ] 50 VUs  0m15.1s/5m0s  00843/10000 shared iters

running (0m15.9s), 50/50 VUs, 895 complete and 0 interrupted iterations
ten_k_load_test   [   9% ] 50 VUs  0m15.9s/5m0s  00895/10000 shared iters

running (0m17.0s), 50/50 VUs, 931 complete and 0 interrupted iterations
ten_k_load_test   [   9% ] 50 VUs  0m17.0s/5m0s  00931/10000 shared iters

running (0m17.9s), 50/50 VUs, 980 complete and 0 interrupted iterations
ten_k_load_test   [  10% ] 50 VUs  0m17.9s/5m0s  00980/10000 shared iters

running (0m18.9s), 50/50 VUs, 1046 complete and 0 interrupted iterations
ten_k_load_test   [  10% ] 50 VUs  0m18.9s/5m0s  01046/10000 shared iters

running (0m19.9s), 50/50 VUs, 1120 complete and 0 interrupted iterations
ten_k_load_test   [  11% ] 50 VUs  0m19.9s/5m0s  01120/10000 shared iters

running (0m21.0s), 50/50 VUs, 1193 complete and 0 interrupted iterations
ten_k_load_test   [  12% ] 50 VUs  0m21.0s/5m0s  01193/10000 shared iters

running (0m22.0s), 50/50 VUs, 1272 complete and 0 interrupted iterations
ten_k_load_test   [  13% ] 50 VUs  0m22.0s/5m0s  01272/10000 shared iters

running (0m22.9s), 50/50 VUs, 1346 complete and 0 interrupted iterations
ten_k_load_test   [  13% ] 50 VUs  0m22.9s/5m0s  01346/10000 shared iters

running (0m23.9s), 50/50 VUs, 1415 complete and 0 interrupted iterations
ten_k_load_test   [  14% ] 50 VUs  0m23.9s/5m0s  01415/10000 shared iters

running (0m24.9s), 50/50 VUs, 1465 complete and 0 interrupted iterations
ten_k_load_test   [  15% ] 50 VUs  0m24.9s/5m0s  01465/10000 shared iters

running (0m25.9s), 50/50 VUs, 1495 complete and 0 interrupted iterations
ten_k_load_test   [  15% ] 50 VUs  0m25.9s/5m0s  01495/10000 shared iters

running (0m26.9s), 50/50 VUs, 1540 complete and 0 interrupted iterations
ten_k_load_test   [  15% ] 50 VUs  0m26.9s/5m0s  01540/10000 shared iters

running (0m27.9s), 50/50 VUs, 1597 complete and 0 interrupted iterations
ten_k_load_test   [  16% ] 50 VUs  0m27.9s/5m0s  01597/10000 shared iters

running (0m28.9s), 50/50 VUs, 1647 complete and 0 interrupted iterations
ten_k_load_test   [  16% ] 50 VUs  0m28.9s/5m0s  01647/10000 shared iters

running (0m29.9s), 50/50 VUs, 1726 complete and 0 interrupted iterations
ten_k_load_test   [  17% ] 50 VUs  0m29.9s/5m0s  01726/10000 shared iters

running (0m30.9s), 50/50 VUs, 1790 complete and 0 interrupted iterations
ten_k_load_test   [  18% ] 50 VUs  0m30.9s/5m0s  01790/10000 shared iters

running (0m31.9s), 50/50 VUs, 1862 complete and 0 interrupted iterations
ten_k_load_test   [  19% ] 50 VUs  0m31.9s/5m0s  01862/10000 shared iters

running (0m32.9s), 50/50 VUs, 1930 complete and 0 interrupted iterations
ten_k_load_test   [  19% ] 50 VUs  0m32.9s/5m0s  01930/10000 shared iters

running (0m33.9s), 50/50 VUs, 1997 complete and 0 interrupted iterations
ten_k_load_test   [  20% ] 50 VUs  0m33.9s/5m0s  01997/10000 shared iters

running (0m34.9s), 50/50 VUs, 2037 complete and 0 interrupted iterations
ten_k_load_test   [  20% ] 50 VUs  0m34.9s/5m0s  02037/10000 shared iters

running (0m36.3s), 50/50 VUs, 2135 complete and 0 interrupted iterations
ten_k_load_test   [  21% ] 50 VUs  0m36.3s/5m0s  02135/10000 shared iters

running (0m36.9s), 50/50 VUs, 2176 complete and 0 interrupted iterations
ten_k_load_test   [  22% ] 50 VUs  0m36.9s/5m0s  02176/10000 shared iters

running (0m37.9s), 50/50 VUs, 2253 complete and 0 interrupted iterations
ten_k_load_test   [  23% ] 50 VUs  0m37.9s/5m0s  02253/10000 shared iters

running (0m38.9s), 50/50 VUs, 2309 complete and 0 interrupted iterations
ten_k_load_test   [  23% ] 50 VUs  0m38.9s/5m0s  02309/10000 shared iters

running (0m40.0s), 50/50 VUs, 2376 complete and 0 interrupted iterations
ten_k_load_test   [  24% ] 50 VUs  0m40.0s/5m0s  02376/10000 shared iters

running (0m40.9s), 50/50 VUs, 2434 complete and 0 interrupted iterations
ten_k_load_test   [  24% ] 50 VUs  0m40.9s/5m0s  02434/10000 shared iters

running (0m41.9s), 50/50 VUs, 2497 complete and 0 interrupted iterations
ten_k_load_test   [  25% ] 50 VUs  0m41.9s/5m0s  02497/10000 shared iters

running (0m43.0s), 50/50 VUs, 2556 complete and 0 interrupted iterations
ten_k_load_test   [  26% ] 50 VUs  0m43.0s/5m0s  02556/10000 shared iters

running (0m43.9s), 50/50 VUs, 2591 complete and 0 interrupted iterations
ten_k_load_test   [  26% ] 50 VUs  0m43.9s/5m0s  02591/10000 shared iters

running (0m45.0s), 50/50 VUs, 2625 complete and 0 interrupted iterations
ten_k_load_test   [  26% ] 50 VUs  0m45.0s/5m0s  02625/10000 shared iters

running (0m45.9s), 50/50 VUs, 2666 complete and 0 interrupted iterations
ten_k_load_test   [  27% ] 50 VUs  0m45.9s/5m0s  02666/10000 shared iters

running (0m47.0s), 50/50 VUs, 2686 complete and 0 interrupted iterations
ten_k_load_test   [  27% ] 50 VUs  0m47.0s/5m0s  02686/10000 shared iters

running (0m48.2s), 50/50 VUs, 2744 complete and 0 interrupted iterations
ten_k_load_test   [  27% ] 50 VUs  0m48.2s/5m0s  02744/10000 shared iters

running (0m49.0s), 50/50 VUs, 2761 complete and 0 interrupted iterations
ten_k_load_test   [  28% ] 50 VUs  0m49.0s/5m0s  02761/10000 shared iters

running (0m50.0s), 50/50 VUs, 2787 complete and 0 interrupted iterations
ten_k_load_test   [  28% ] 50 VUs  0m50.0s/5m0s  02787/10000 shared iters

running (0m51.0s), 50/50 VUs, 2836 complete and 0 interrupted iterations
ten_k_load_test   [  28% ] 50 VUs  0m51.0s/5m0s  02836/10000 shared iters

running (0m51.9s), 50/50 VUs, 2847 complete and 0 interrupted iterations
ten_k_load_test   [  28% ] 50 VUs  0m51.9s/5m0s  02847/10000 shared iters

running (0m53.1s), 50/50 VUs, 2910 complete and 0 interrupted iterations
ten_k_load_test   [  29% ] 50 VUs  0m53.1s/5m0s  02910/10000 shared iters

running (0m53.9s), 50/50 VUs, 2927 complete and 0 interrupted iterations
ten_k_load_test   [  29% ] 50 VUs  0m53.9s/5m0s  02927/10000 shared iters

running (0m55.1s), 50/50 VUs, 2985 complete and 0 interrupted iterations
ten_k_load_test   [  30% ] 50 VUs  0m55.1s/5m0s  02985/10000 shared iters

running (0m55.9s), 50/50 VUs, 3004 complete and 0 interrupted iterations
ten_k_load_test   [  30% ] 50 VUs  0m55.9s/5m0s  03004/10000 shared iters

running (0m56.9s), 50/50 VUs, 3029 complete and 0 interrupted iterations
ten_k_load_test   [  30% ] 50 VUs  0m56.9s/5m0s  03029/10000 shared iters

running (0m57.9s), 50/50 VUs, 3080 complete and 0 interrupted iterations
ten_k_load_test   [  31% ] 50 VUs  0m57.9s/5m0s  03080/10000 shared iters

running (0m59.1s), 50/50 VUs, 3117 complete and 0 interrupted iterations
ten_k_load_test   [  31% ] 50 VUs  0m59.1s/5m0s  03117/10000 shared iters

running (0m59.9s), 50/50 VUs, 3132 complete and 0 interrupted iterations
ten_k_load_test   [  31% ] 50 VUs  0m59.9s/5m0s  03132/10000 shared iters

running (1m01.0s), 50/50 VUs, 3185 complete and 0 interrupted iterations
ten_k_load_test   [  32% ] 50 VUs  1m01.0s/5m0s  03185/10000 shared iters

running (1m01.9s), 50/50 VUs, 3209 complete and 0 interrupted iterations
ten_k_load_test   [  32% ] 50 VUs  1m01.9s/5m0s  03209/10000 shared iters

running (1m02.9s), 50/50 VUs, 3241 complete and 0 interrupted iterations
ten_k_load_test   [  32% ] 50 VUs  1m02.9s/5m0s  03241/10000 shared iters

running (1m03.9s), 50/50 VUs, 3276 complete and 0 interrupted iterations
ten_k_load_test   [  33% ] 50 VUs  1m03.9s/5m0s  03276/10000 shared iters

running (1m05.0s), 50/50 VUs, 3310 complete and 0 interrupted iterations
ten_k_load_test   [  33% ] 50 VUs  1m05.0s/5m0s  03310/10000 shared iters

running (1m06.0s), 50/50 VUs, 3356 complete and 0 interrupted iterations
ten_k_load_test   [  34% ] 50 VUs  1m06.0s/5m0s  03356/10000 shared iters

running (1m06.9s), 50/50 VUs, 3388 complete and 0 interrupted iterations
ten_k_load_test   [  34% ] 50 VUs  1m06.9s/5m0s  03388/10000 shared iters

running (1m07.9s), 50/50 VUs, 3424 complete and 0 interrupted iterations
ten_k_load_test   [  34% ] 50 VUs  1m07.9s/5m0s  03424/10000 shared iters

running (1m09.0s), 50/50 VUs, 3484 complete and 0 interrupted iterations
ten_k_load_test   [  35% ] 50 VUs  1m09.0s/5m0s  03484/10000 shared iters

running (1m09.9s), 50/50 VUs, 3530 complete and 0 interrupted iterations
ten_k_load_test   [  35% ] 50 VUs  1m09.9s/5m0s  03530/10000 shared iters

running (1m11.1s), 50/50 VUs, 3561 complete and 0 interrupted iterations
ten_k_load_test   [  36% ] 50 VUs  1m11.1s/5m0s  03561/10000 shared iters

running (1m11.9s), 50/50 VUs, 3602 complete and 0 interrupted iterations
ten_k_load_test   [  36% ] 50 VUs  1m11.9s/5m0s  03602/10000 shared iters

running (1m12.9s), 50/50 VUs, 3652 complete and 0 interrupted iterations
ten_k_load_test   [  37% ] 50 VUs  1m12.9s/5m0s  03652/10000 shared iters

running (1m13.9s), 50/50 VUs, 3702 complete and 0 interrupted iterations
ten_k_load_test   [  37% ] 50 VUs  1m13.9s/5m0s  03702/10000 shared iters

running (1m14.9s), 50/50 VUs, 3710 complete and 0 interrupted iterations
ten_k_load_test   [  37% ] 50 VUs  1m14.9s/5m0s  03710/10000 shared iters

running (1m15.9s), 50/50 VUs, 3736 complete and 0 interrupted iterations
ten_k_load_test   [  37% ] 50 VUs  1m15.9s/5m0s  03736/10000 shared iters

running (1m16.9s), 50/50 VUs, 3792 complete and 0 interrupted iterations
ten_k_load_test   [  38% ] 50 VUs  1m16.9s/5m0s  03792/10000 shared iters

running (1m17.9s), 50/50 VUs, 3828 complete and 0 interrupted iterations
ten_k_load_test   [  38% ] 50 VUs  1m17.9s/5m0s  03828/10000 shared iters

running (1m18.9s), 50/50 VUs, 3854 complete and 0 interrupted iterations
ten_k_load_test   [  39% ] 50 VUs  1m18.9s/5m0s  03854/10000 shared iters

running (1m19.9s), 50/50 VUs, 3907 complete and 0 interrupted iterations
ten_k_load_test   [  39% ] 50 VUs  1m19.9s/5m0s  03907/10000 shared iters

running (1m21.0s), 50/50 VUs, 3928 complete and 0 interrupted iterations
ten_k_load_test   [  39% ] 50 VUs  1m21.0s/5m0s  03928/10000 shared iters

running (1m21.9s), 50/50 VUs, 3961 complete and 0 interrupted iterations
ten_k_load_test   [  40% ] 50 VUs  1m21.9s/5m0s  03961/10000 shared iters

running (1m22.9s), 50/50 VUs, 3974 complete and 0 interrupted iterations
ten_k_load_test   [  40% ] 50 VUs  1m22.9s/5m0s  03974/10000 shared iters

running (1m24.0s), 50/50 VUs, 4029 complete and 0 interrupted iterations
ten_k_load_test   [  40% ] 50 VUs  1m24.0s/5m0s  04029/10000 shared iters

running (1m24.9s), 50/50 VUs, 4047 complete and 0 interrupted iterations
ten_k_load_test   [  40% ] 50 VUs  1m24.9s/5m0s  04047/10000 shared iters

running (1m25.9s), 50/50 VUs, 4068 complete and 0 interrupted iterations
ten_k_load_test   [  41% ] 50 VUs  1m25.9s/5m0s  04068/10000 shared iters

running (1m26.9s), 50/50 VUs, 4104 complete and 0 interrupted iterations
ten_k_load_test   [  41% ] 50 VUs  1m26.9s/5m0s  04104/10000 shared iters

running (1m28.1s), 50/50 VUs, 4159 complete and 0 interrupted iterations
ten_k_load_test   [  42% ] 50 VUs  1m28.1s/5m0s  04159/10000 shared iters

running (1m28.9s), 50/50 VUs, 4189 complete and 0 interrupted iterations
ten_k_load_test   [  42% ] 50 VUs  1m28.9s/5m0s  04189/10000 shared iters

running (1m29.9s), 50/50 VUs, 4254 complete and 0 interrupted iterations
ten_k_load_test   [  43% ] 50 VUs  1m29.9s/5m0s  04254/10000 shared iters

running (1m30.9s), 50/50 VUs, 4281 complete and 0 interrupted iterations
ten_k_load_test   [  43% ] 50 VUs  1m30.9s/5m0s  04281/10000 shared iters

running (1m31.9s), 50/50 VUs, 4324 complete and 0 interrupted iterations
ten_k_load_test   [  43% ] 50 VUs  1m31.9s/5m0s  04324/10000 shared iters

running (1m32.9s), 50/50 VUs, 4347 complete and 0 interrupted iterations
ten_k_load_test   [  43% ] 50 VUs  1m32.9s/5m0s  04347/10000 shared iters

running (1m33.9s), 50/50 VUs, 4417 complete and 0 interrupted iterations
ten_k_load_test   [  44% ] 50 VUs  1m33.9s/5m0s  04417/10000 shared iters

running (1m34.9s), 50/50 VUs, 4461 complete and 0 interrupted iterations
ten_k_load_test   [  45% ] 50 VUs  1m34.9s/5m0s  04461/10000 shared iters

running (1m35.9s), 50/50 VUs, 4497 complete and 0 interrupted iterations
ten_k_load_test   [  45% ] 50 VUs  1m35.9s/5m0s  04497/10000 shared iters

running (1m36.9s), 50/50 VUs, 4548 complete and 0 interrupted iterations
ten_k_load_test   [  45% ] 50 VUs  1m36.9s/5m0s  04548/10000 shared iters

running (1m37.9s), 50/50 VUs, 4567 complete and 0 interrupted iterations
ten_k_load_test   [  46% ] 50 VUs  1m37.9s/5m0s  04567/10000 shared iters

running (1m39.0s), 50/50 VUs, 4623 complete and 0 interrupted iterations
ten_k_load_test   [  46% ] 50 VUs  1m39.0s/5m0s  04623/10000 shared iters

running (1m40.3s), 50/50 VUs, 4649 complete and 0 interrupted iterations
ten_k_load_test   [  46% ] 50 VUs  1m40.3s/5m0s  04649/10000 shared iters

running (1m40.9s), 50/50 VUs, 4668 complete and 0 interrupted iterations
ten_k_load_test   [  47% ] 50 VUs  1m40.9s/5m0s  04668/10000 shared iters

running (1m41.9s), 50/50 VUs, 4709 complete and 0 interrupted iterations
ten_k_load_test   [  47% ] 50 VUs  1m41.9s/5m0s  04709/10000 shared iters

running (1m42.9s), 50/50 VUs, 4757 complete and 0 interrupted iterations
ten_k_load_test   [  48% ] 50 VUs  1m42.9s/5m0s  04757/10000 shared iters

running (1m43.9s), 50/50 VUs, 4786 complete and 0 interrupted iterations
ten_k_load_test   [  48% ] 50 VUs  1m43.9s/5m0s  04786/10000 shared iters

running (1m44.9s), 50/50 VUs, 4807 complete and 0 interrupted iterations
ten_k_load_test   [  48% ] 50 VUs  1m44.9s/5m0s  04807/10000 shared iters

running (1m45.9s), 50/50 VUs, 4831 complete and 0 interrupted iterations
ten_k_load_test   [  48% ] 50 VUs  1m45.9s/5m0s  04831/10000 shared iters

running (1m47.0s), 50/50 VUs, 4867 complete and 0 interrupted iterations
ten_k_load_test   [  49% ] 50 VUs  1m47.0s/5m0s  04867/10000 shared iters

running (1m48.2s), 50/50 VUs, 4916 complete and 0 interrupted iterations
ten_k_load_test   [  49% ] 50 VUs  1m48.2s/5m0s  04916/10000 shared iters

running (1m48.9s), 50/50 VUs, 4927 complete and 0 interrupted iterations
ten_k_load_test   [  49% ] 50 VUs  1m48.9s/5m0s  04927/10000 shared iters

running (1m50.0s), 50/50 VUs, 4988 complete and 0 interrupted iterations
ten_k_load_test   [  50% ] 50 VUs  1m50.0s/5m0s  04988/10000 shared iters

running (1m50.9s), 50/50 VUs, 4998 complete and 0 interrupted iterations
ten_k_load_test   [  50% ] 50 VUs  1m50.9s/5m0s  04998/10000 shared iters

running (1m53.1s), 50/50 VUs, 5073 complete and 0 interrupted iterations
ten_k_load_test   [  51% ] 50 VUs  1m53.1s/5m0s  05073/10000 shared iters

running (1m53.1s), 50/50 VUs, 5073 complete and 0 interrupted iterations
ten_k_load_test   [  51% ] 50 VUs  1m53.1s/5m0s  05073/10000 shared iters

running (1m54.1s), 50/50 VUs, 5094 complete and 0 interrupted iterations
ten_k_load_test   [  51% ] 50 VUs  1m54.1s/5m0s  05094/10000 shared iters

running (1m54.9s), 50/50 VUs, 5104 complete and 0 interrupted iterations
ten_k_load_test   [  51% ] 50 VUs  1m54.9s/5m0s  05104/10000 shared iters

running (1m56.0s), 50/50 VUs, 5131 complete and 0 interrupted iterations
ten_k_load_test   [  51% ] 50 VUs  1m56.0s/5m0s  05131/10000 shared iters

running (1m56.9s), 50/50 VUs, 5165 complete and 0 interrupted iterations
ten_k_load_test   [  52% ] 50 VUs  1m56.9s/5m0s  05165/10000 shared iters

running (1m58.1s), 50/50 VUs, 5216 complete and 0 interrupted iterations
ten_k_load_test   [  52% ] 50 VUs  1m58.1s/5m0s  05216/10000 shared iters

running (1m59.4s), 50/50 VUs, 5253 complete and 0 interrupted iterations
ten_k_load_test   [  53% ] 50 VUs  1m59.4s/5m0s  05253/10000 shared iters

running (1m59.9s), 50/50 VUs, 5257 complete and 0 interrupted iterations
ten_k_load_test   [  53% ] 50 VUs  1m59.9s/5m0s  05257/10000 shared iters

running (2m00.9s), 50/50 VUs, 5303 complete and 0 interrupted iterations
ten_k_load_test   [  53% ] 50 VUs  2m00.9s/5m0s  05303/10000 shared iters

running (2m01.9s), 50/50 VUs, 5319 complete and 0 interrupted iterations
ten_k_load_test   [  53% ] 50 VUs  2m02.0s/5m0s  05322/10000 shared iters

running (2m02.9s), 50/50 VUs, 5340 complete and 0 interrupted iterations
ten_k_load_test   [  53% ] 50 VUs  2m02.9s/5m0s  05340/10000 shared iters

running (2m03.9s), 50/50 VUs, 5392 complete and 0 interrupted iterations
ten_k_load_test   [  54% ] 50 VUs  2m03.9s/5m0s  05392/10000 shared iters

running (2m04.9s), 50/50 VUs, 5415 complete and 0 interrupted iterations
ten_k_load_test   [  54% ] 50 VUs  2m04.9s/5m0s  05415/10000 shared iters

running (2m05.9s), 50/50 VUs, 5478 complete and 0 interrupted iterations
ten_k_load_test   [  55% ] 50 VUs  2m05.9s/5m0s  05478/10000 shared iters

running (2m06.9s), 50/50 VUs, 5495 complete and 0 interrupted iterations
ten_k_load_test   [  55% ] 50 VUs  2m06.9s/5m0s  05495/10000 shared iters

running (2m08.3s), 50/50 VUs, 5571 complete and 0 interrupted iterations
ten_k_load_test   [  56% ] 50 VUs  2m08.3s/5m0s  05571/10000 shared iters

running (2m08.9s), 50/50 VUs, 5582 complete and 0 interrupted iterations
ten_k_load_test   [  56% ] 50 VUs  2m08.9s/5m0s  05582/10000 shared iters

running (2m09.9s), 50/50 VUs, 5616 complete and 0 interrupted iterations
ten_k_load_test   [  56% ] 50 VUs  2m09.9s/5m0s  05616/10000 shared iters

running (2m10.9s), 50/50 VUs, 5635 complete and 0 interrupted iterations
ten_k_load_test   [  56% ] 50 VUs  2m10.9s/5m0s  05635/10000 shared iters

running (2m11.9s), 50/50 VUs, 5688 complete and 0 interrupted iterations
ten_k_load_test   [  57% ] 50 VUs  2m11.9s/5m0s  05688/10000 shared iters

running (2m12.9s), 50/50 VUs, 5710 complete and 0 interrupted iterations
ten_k_load_test   [  57% ] 50 VUs  2m12.9s/5m0s  05710/10000 shared iters

running (2m13.9s), 50/50 VUs, 5763 complete and 0 interrupted iterations
ten_k_load_test   [  58% ] 50 VUs  2m13.9s/5m0s  05763/10000 shared iters

running (2m15.0s), 50/50 VUs, 5789 complete and 0 interrupted iterations
ten_k_load_test   [  58% ] 50 VUs  2m15.0s/5m0s  05789/10000 shared iters

running (2m15.9s), 50/50 VUs, 5808 complete and 0 interrupted iterations
ten_k_load_test   [  58% ] 50 VUs  2m15.9s/5m0s  05808/10000 shared iters

running (2m17.0s), 50/50 VUs, 5860 complete and 0 interrupted iterations
ten_k_load_test   [  59% ] 50 VUs  2m17.0s/5m0s  05860/10000 shared iters

running (2m17.9s), 50/50 VUs, 5880 complete and 0 interrupted iterations
ten_k_load_test   [  59% ] 50 VUs  2m17.9s/5m0s  05880/10000 shared iters

running (2m18.9s), 50/50 VUs, 5940 complete and 0 interrupted iterations
ten_k_load_test   [  59% ] 50 VUs  2m18.9s/5m0s  05940/10000 shared iters

running (2m19.9s), 50/50 VUs, 5956 complete and 0 interrupted iterations
ten_k_load_test   [  60% ] 50 VUs  2m19.9s/5m0s  05956/10000 shared iters

running (2m21.1s), 50/50 VUs, 6021 complete and 0 interrupted iterations
ten_k_load_test   [  60% ] 50 VUs  2m21.1s/5m0s  06021/10000 shared iters

running (2m21.9s), 50/50 VUs, 6054 complete and 0 interrupted iterations
ten_k_load_test   [  61% ] 50 VUs  2m21.9s/5m0s  06054/10000 shared iters

running (2m22.9s), 50/50 VUs, 6093 complete and 0 interrupted iterations
ten_k_load_test   [  61% ] 50 VUs  2m23.1s/5m0s  06098/10000 shared iters

running (2m23.9s), 50/50 VUs, 6130 complete and 0 interrupted iterations
ten_k_load_test   [  61% ] 50 VUs  2m23.9s/5m0s  06130/10000 shared iters

running (2m25.0s), 50/50 VUs, 6178 complete and 0 interrupted iterations
ten_k_load_test   [  62% ] 50 VUs  2m25.0s/5m0s  06178/10000 shared iters

running (2m26.0s), 50/50 VUs, 6206 complete and 0 interrupted iterations
ten_k_load_test   [  62% ] 50 VUs  2m26.0s/5m0s  06206/10000 shared iters

running (2m26.9s), 50/50 VUs, 6218 complete and 0 interrupted iterations
ten_k_load_test   [  62% ] 50 VUs  2m26.9s/5m0s  06218/10000 shared iters

running (2m28.0s), 50/50 VUs, 6246 complete and 0 interrupted iterations
ten_k_load_test   [  62% ] 50 VUs  2m28.0s/5m0s  06246/10000 shared iters

running (2m28.9s), 50/50 VUs, 6283 complete and 0 interrupted iterations
ten_k_load_test   [  63% ] 50 VUs  2m28.9s/5m0s  06283/10000 shared iters

running (2m29.9s), 50/50 VUs, 6319 complete and 0 interrupted iterations
ten_k_load_test   [  63% ] 50 VUs  2m29.9s/5m0s  06319/10000 shared iters

running (2m30.9s), 50/50 VUs, 6367 complete and 0 interrupted iterations
ten_k_load_test   [  64% ] 50 VUs  2m30.9s/5m0s  06367/10000 shared iters

running (2m31.9s), 50/50 VUs, 6426 complete and 0 interrupted iterations
ten_k_load_test   [  64% ] 50 VUs  2m31.9s/5m0s  06426/10000 shared iters

running (2m32.9s), 50/50 VUs, 6454 complete and 0 interrupted iterations
ten_k_load_test   [  65% ] 50 VUs  2m32.9s/5m0s  06454/10000 shared iters

running (2m34.2s), 50/50 VUs, 6509 complete and 0 interrupted iterations
ten_k_load_test   [  65% ] 50 VUs  2m34.2s/5m0s  06509/10000 shared iters

running (2m35.0s), 50/50 VUs, 6567 complete and 0 interrupted iterations
ten_k_load_test   [  66% ] 50 VUs  2m35.0s/5m0s  06567/10000 shared iters

running (2m35.9s), 50/50 VUs, 6593 complete and 0 interrupted iterations
ten_k_load_test   [  66% ] 50 VUs  2m35.9s/5m0s  06593/10000 shared iters

running (2m37.0s), 50/50 VUs, 6661 complete and 0 interrupted iterations
ten_k_load_test   [  67% ] 50 VUs  2m37.0s/5m0s  06661/10000 shared iters

running (2m37.9s), 50/50 VUs, 6732 complete and 0 interrupted iterations
ten_k_load_test   [  67% ] 50 VUs  2m37.9s/5m0s  06732/10000 shared iters

running (2m39.1s), 50/50 VUs, 6766 complete and 0 interrupted iterations
ten_k_load_test   [  68% ] 50 VUs  2m39.1s/5m0s  06766/10000 shared iters

running (2m39.9s), 50/50 VUs, 6822 complete and 0 interrupted iterations
ten_k_load_test   [  68% ] 50 VUs  2m39.9s/5m0s  06822/10000 shared iters

running (2m40.9s), 50/50 VUs, 6842 complete and 0 interrupted iterations
ten_k_load_test   [  68% ] 50 VUs  2m40.9s/5m0s  06842/10000 shared iters

running (2m41.9s), 50/50 VUs, 6907 complete and 0 interrupted iterations
ten_k_load_test   [  69% ] 50 VUs  2m41.9s/5m0s  06907/10000 shared iters

running (2m42.9s), 50/50 VUs, 6953 complete and 0 interrupted iterations
ten_k_load_test   [  70% ] 50 VUs  2m42.9s/5m0s  06953/10000 shared iters

running (2m43.9s), 50/50 VUs, 7011 complete and 0 interrupted iterations
ten_k_load_test   [  70% ] 50 VUs  2m43.9s/5m0s  07011/10000 shared iters

running (2m44.9s), 50/50 VUs, 7033 complete and 0 interrupted iterations
ten_k_load_test   [  70% ] 50 VUs  2m44.9s/5m0s  07033/10000 shared iters

running (2m45.9s), 50/50 VUs, 7098 complete and 0 interrupted iterations
ten_k_load_test   [  71% ] 50 VUs  2m45.9s/5m0s  07098/10000 shared iters

running (2m46.9s), 50/50 VUs, 7146 complete and 0 interrupted iterations
ten_k_load_test   [  71% ] 50 VUs  2m46.9s/5m0s  07146/10000 shared iters

running (2m48.0s), 50/50 VUs, 7194 complete and 0 interrupted iterations
ten_k_load_test   [  72% ] 50 VUs  2m48.0s/5m0s  07194/10000 shared iters

running (2m48.9s), 50/50 VUs, 7223 complete and 0 interrupted iterations
ten_k_load_test   [  72% ] 50 VUs  2m48.9s/5m0s  07223/10000 shared iters

running (2m49.9s), 50/50 VUs, 7254 complete and 0 interrupted iterations
ten_k_load_test   [  73% ] 50 VUs  2m49.9s/5m0s  07254/10000 shared iters

running (2m50.9s), 50/50 VUs, 7292 complete and 0 interrupted iterations
ten_k_load_test   [  73% ] 50 VUs  2m50.9s/5m0s  07292/10000 shared iters

running (2m51.9s), 50/50 VUs, 7339 complete and 0 interrupted iterations
ten_k_load_test   [  73% ] 50 VUs  2m51.9s/5m0s  07339/10000 shared iters

running (2m52.9s), 50/50 VUs, 7389 complete and 0 interrupted iterations
ten_k_load_test   [  74% ] 50 VUs  2m52.9s/5m0s  07389/10000 shared iters

running (2m54.1s), 50/50 VUs, 7433 complete and 0 interrupted iterations
ten_k_load_test   [  74% ] 50 VUs  2m54.1s/5m0s  07433/10000 shared iters

running (2m54.9s), 50/50 VUs, 7492 complete and 0 interrupted iterations
ten_k_load_test   [  75% ] 50 VUs  2m54.9s/5m0s  07492/10000 shared iters

running (2m55.9s), 50/50 VUs, 7559 complete and 0 interrupted iterations
ten_k_load_test   [  76% ] 50 VUs  2m55.9s/5m0s  07559/10000 shared iters

running (2m56.9s), 50/50 VUs, 7608 complete and 0 interrupted iterations
ten_k_load_test   [  76% ] 50 VUs  2m56.9s/5m0s  07608/10000 shared iters

running (2m58.1s), 50/50 VUs, 7688 complete and 0 interrupted iterations
ten_k_load_test   [  77% ] 50 VUs  2m58.1s/5m0s  07688/10000 shared iters

running (2m58.9s), 50/50 VUs, 7739 complete and 0 interrupted iterations
ten_k_load_test   [  77% ] 50 VUs  2m58.9s/5m0s  07739/10000 shared iters

running (3m00.0s), 50/50 VUs, 7809 complete and 0 interrupted iterations
ten_k_load_test   [  78% ] 50 VUs  3m00.0s/5m0s  07809/10000 shared iters

running (3m00.9s), 50/50 VUs, 7843 complete and 0 interrupted iterations
ten_k_load_test   [  78% ] 50 VUs  3m00.9s/5m0s  07843/10000 shared iters

running (3m02.0s), 50/50 VUs, 7906 complete and 0 interrupted iterations
ten_k_load_test   [  79% ] 50 VUs  3m02.0s/5m0s  07906/10000 shared iters

running (3m02.9s), 50/50 VUs, 7950 complete and 0 interrupted iterations
ten_k_load_test   [  80% ] 50 VUs  3m02.9s/5m0s  07950/10000 shared iters

running (3m04.0s), 50/50 VUs, 7984 complete and 0 interrupted iterations
ten_k_load_test   [  80% ] 50 VUs  3m04.0s/5m0s  07984/10000 shared iters

running (3m04.9s), 50/50 VUs, 8028 complete and 0 interrupted iterations
ten_k_load_test   [  80% ] 50 VUs  3m04.9s/5m0s  08028/10000 shared iters

running (3m05.9s), 50/50 VUs, 8050 complete and 0 interrupted iterations
ten_k_load_test   [  80% ] 50 VUs  3m05.9s/5m0s  08050/10000 shared iters

running (3m06.9s), 50/50 VUs, 8112 complete and 0 interrupted iterations
ten_k_load_test   [  81% ] 50 VUs  3m06.9s/5m0s  08112/10000 shared iters

running (3m07.9s), 50/50 VUs, 8158 complete and 0 interrupted iterations
ten_k_load_test   [  82% ] 50 VUs  3m07.9s/5m0s  08158/10000 shared iters

running (3m08.9s), 50/50 VUs, 8199 complete and 0 interrupted iterations
ten_k_load_test   [  82% ] 50 VUs  3m08.9s/5m0s  08199/10000 shared iters

running (3m09.9s), 50/50 VUs, 8229 complete and 0 interrupted iterations
ten_k_load_test   [  82% ] 50 VUs  3m09.9s/5m0s  08229/10000 shared iters

running (3m10.9s), 50/50 VUs, 8291 complete and 0 interrupted iterations
ten_k_load_test   [  83% ] 50 VUs  3m10.9s/5m0s  08291/10000 shared iters

running (3m11.9s), 50/50 VUs, 8335 complete and 0 interrupted iterations
ten_k_load_test   [  83% ] 50 VUs  3m11.9s/5m0s  08335/10000 shared iters

running (3m12.9s), 50/50 VUs, 8355 complete and 0 interrupted iterations
ten_k_load_test   [  84% ] 50 VUs  3m12.9s/5m0s  08355/10000 shared iters

running (3m13.9s), 50/50 VUs, 8407 complete and 0 interrupted iterations
ten_k_load_test   [  84% ] 50 VUs  3m13.9s/5m0s  08407/10000 shared iters

running (3m14.9s), 50/50 VUs, 8443 complete and 0 interrupted iterations
ten_k_load_test   [  84% ] 50 VUs  3m14.9s/5m0s  08443/10000 shared iters

running (3m15.9s), 50/50 VUs, 8490 complete and 0 interrupted iterations
ten_k_load_test   [  85% ] 50 VUs  3m15.9s/5m0s  08490/10000 shared iters

running (3m16.9s), 50/50 VUs, 8510 complete and 0 interrupted iterations
ten_k_load_test   [  85% ] 50 VUs  3m16.9s/5m0s  08510/10000 shared iters

running (3m18.3s), 50/50 VUs, 8577 complete and 0 interrupted iterations
ten_k_load_test   [  86% ] 50 VUs  3m18.3s/5m0s  08577/10000 shared iters

running (3m18.9s), 50/50 VUs, 8599 complete and 0 interrupted iterations
ten_k_load_test   [  86% ] 50 VUs  3m18.9s/5m0s  08599/10000 shared iters

running (3m19.9s), 50/50 VUs, 8629 complete and 0 interrupted iterations
ten_k_load_test   [  86% ] 50 VUs  3m19.9s/5m0s  08629/10000 shared iters

running (3m21.0s), 50/50 VUs, 8696 complete and 0 interrupted iterations
ten_k_load_test   [  87% ] 50 VUs  3m21.0s/5m0s  08696/10000 shared iters

running (3m22.0s), 50/50 VUs, 8757 complete and 0 interrupted iterations
ten_k_load_test   [  88% ] 50 VUs  3m22.0s/5m0s  08757/10000 shared iters

running (3m22.9s), 50/50 VUs, 8805 complete and 0 interrupted iterations
ten_k_load_test   [  88% ] 50 VUs  3m22.9s/5m0s  08805/10000 shared iters

running (3m23.9s), 50/50 VUs, 8859 complete and 0 interrupted iterations
ten_k_load_test   [  89% ] 50 VUs  3m23.9s/5m0s  08859/10000 shared iters

running (3m24.9s), 50/50 VUs, 8914 complete and 0 interrupted iterations
ten_k_load_test   [  89% ] 50 VUs  3m24.9s/5m0s  08914/10000 shared iters

running (3m25.9s), 50/50 VUs, 8948 complete and 0 interrupted iterations
ten_k_load_test   [  89% ] 50 VUs  3m25.9s/5m0s  08948/10000 shared iters

running (3m26.9s), 50/50 VUs, 9014 complete and 0 interrupted iterations
ten_k_load_test   [  90% ] 50 VUs  3m26.9s/5m0s  09014/10000 shared iters

running (3m27.9s), 50/50 VUs, 9095 complete and 0 interrupted iterations
ten_k_load_test   [  91% ] 50 VUs  3m27.9s/5m0s  09095/10000 shared iters

running (3m29.1s), 50/50 VUs, 9159 complete and 0 interrupted iterations
ten_k_load_test   [  92% ] 50 VUs  3m29.1s/5m0s  09159/10000 shared iters

running (3m29.9s), 50/50 VUs, 9209 complete and 0 interrupted iterations
ten_k_load_test   [  92% ] 50 VUs  3m29.9s/5m0s  09209/10000 shared iters

running (3m31.3s), 50/50 VUs, 9269 complete and 0 interrupted iterations
ten_k_load_test   [  93% ] 50 VUs  3m31.3s/5m0s  09269/10000 shared iters

running (3m32.0s), 50/50 VUs, 9308 complete and 0 interrupted iterations
ten_k_load_test   [  93% ] 50 VUs  3m32.0s/5m0s  09308/10000 shared iters

running (3m33.0s), 50/50 VUs, 9355 complete and 0 interrupted iterations
ten_k_load_test   [  94% ] 50 VUs  3m33.0s/5m0s  09355/10000 shared iters

running (3m34.3s), 50/50 VUs, 9405 complete and 0 interrupted iterations
ten_k_load_test   [  94% ] 50 VUs  3m34.3s/5m0s  09405/10000 shared iters

running (3m34.9s), 50/50 VUs, 9432 complete and 0 interrupted iterations
ten_k_load_test   [  94% ] 50 VUs  3m34.9s/5m0s  09432/10000 shared iters

running (3m35.9s), 50/50 VUs, 9491 complete and 0 interrupted iterations
ten_k_load_test   [  95% ] 50 VUs  3m35.9s/5m0s  09491/10000 shared iters

running (3m36.9s), 50/50 VUs, 9525 complete and 0 interrupted iterations
ten_k_load_test   [  95% ] 50 VUs  3m36.9s/5m0s  09525/10000 shared iters

running (3m37.9s), 50/50 VUs, 9575 complete and 0 interrupted iterations
ten_k_load_test   [  96% ] 50 VUs  3m37.9s/5m0s  09575/10000 shared iters

running (3m39.0s), 50/50 VUs, 9604 complete and 0 interrupted iterations
ten_k_load_test   [  96% ] 50 VUs  3m39.0s/5m0s  09604/10000 shared iters

running (3m39.9s), 50/50 VUs, 9642 complete and 0 interrupted iterations
ten_k_load_test   [  96% ] 50 VUs  3m39.9s/5m0s  09642/10000 shared iters

running (3m40.9s), 50/50 VUs, 9698 complete and 0 interrupted iterations
ten_k_load_test   [  97% ] 50 VUs  3m40.9s/5m0s  09698/10000 shared iters

running (3m41.9s), 50/50 VUs, 9738 complete and 0 interrupted iterations
ten_k_load_test   [  97% ] 50 VUs  3m41.9s/5m0s  09738/10000 shared iters

running (3m42.9s), 50/50 VUs, 9784 complete and 0 interrupted iterations
ten_k_load_test   [  98% ] 50 VUs  3m42.9s/5m0s  09784/10000 shared iters

running (3m43.9s), 50/50 VUs, 9839 complete and 0 interrupted iterations
ten_k_load_test   [  98% ] 50 VUs  3m43.9s/5m0s  09839/10000 shared iters

running (3m44.9s), 50/50 VUs, 9887 complete and 0 interrupted iterations
ten_k_load_test   [  99% ] 50 VUs  3m44.9s/5m0s  09887/10000 shared iters

running (3m45.9s), 50/50 VUs, 9949 complete and 0 interrupted iterations
ten_k_load_test   [  99% ] 50 VUs  3m45.9s/5m0s  09949/10000 shared iters


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=1.18s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 10000   44.194163/s
    checks_succeeded...: 100.00% 10000 out of 10000
    checks_failed......: 0.00%   0 out of 10000

    ✓ status is 202

    CUSTOM
    successful_ingestions..........: 10000  44.194163/s

    HTTP
    http_req_duration..............: avg=573.15ms min=46.32ms med=503.31ms max=2.61s p(90)=994.52ms p(95)=1.18s
      { expected_response:true }...: avg=573.15ms min=46.32ms med=503.31ms max=2.61s p(90)=994.52ms p(95)=1.18s
    http_req_failed................: 0.00%  0 out of 10000
    http_reqs......................: 10000  44.194163/s

    EXECUTION
    iteration_duration.............: avg=1.12s    min=80.87ms med=1.02s    max=4.52s p(90)=1.94s    p(95)=2.22s
    iterations.....................: 10000  44.194163/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 2.2 MB 9.7 kB/s
    data_sent......................: 5.1 GB 23 MB/s



running (3m46.3s), 00/50 VUs, 10000 complete and 0 interrupted iterations
ten_k_load_test ✓ [ 100% ] 50 VUs  3m46.3s/5m0s  10000/10000 shared iters